using System;

namespace Task_18_2
{
	class Program
	{
		static void Main(string[] args)
		{
			Console.WriteLine("Выберите мелодию. Нажмите 1 - для мелодии по заданию. 2 - для мелодии от меня)");

			int x = int.Parse(Console.ReadLine());

			if (x == 1)
			{
				string melody = "987 876 765 654 543 432 111 8";

				Note[] notes = MelodyParser.ParseMelody(melody);

				Player.play(notes);
			}
			if (x == 2)
			{
				string melody1 = "440, 500; 440, 500; 440, 500; 349, 350; 523, 150; 440, 500; 349, 350; 523, 150; 440, 650; 0, 150; 659, 500; 659, 500; 659, 500; 698, 350; 523, 150; 415, 500; 349, 350; 523, 150; 440, 650; 0, 150; 880, 500; 440, 300; 440, 150; 880, 400; 830, 200; 784, 200; 740, 125; 698, 125; 740, 250; 0, 250; 455, 250; 622, 400; 587, 200; 554, 200; 523, 125; 466, 125; 523, 250; 0, 250; 349, 125; 415, 500; 349, 375; 440, 125; 523, 500; 440, 375; 523, 125; 659, 650; 880, 500; 440, 300; 440, 150; 880, 400; 830, 200; 784, 200; 740, 125; 698, 125; 740, 250; 0, 250; 455, 250; 622, 400; 587, 200; 554, 200; 523, 125; 466, 125; 523, 250;  0, 250; 349, 250; 415, 500; 349, 375; 523, 125; 440, 500; 349, 375; 523, 125; 440, 650;";


				Note[] notes = MelodyParser.ParseTrue(melody1);

				Player.play(notes);
			}

			Console.ReadKey();
		}
	}
}
